export const VALIDATE_CONFIG = {
  requiredMessage: "Поле не может быть пустым",
  email: "Некорректный формат email",
  password:
    "Пароль должен содержать минимум 8 символов, одну букву латинского алфавита и одну цифру",
  passwordLength: "Минимум 8 символов",
  minLength: "Минимум 2 символа",
  url: "Некорректный формат ссылки"
};
export const EMAIL_REGEXP =
  /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/;
export const PASS_REGEXP = /^(?=.*[A-Za-z])(?=.*\d)[A-Za-z\d]{8,}$/;
export const URL_REGEXP = /^(?:http(s)?:\/\/)?[\w.-]+(?:\.[\w\.-]+)+[\w\-\._~:/?#[\]@!\$&'\(\)\*\+,;=.]+$/gm
